[
  {
    "id": 1,
    "setup": "Why did the scarecrow win an award?",
    "punchline": "Because he was outstanding in his field."
  },
  {
    "id": "2",
    "setup": "I told my wife she was drawing her eyebrows too high.",
    "punchline": "She looked surprised."
  },
  {
    "id": 3,
    "setup": "I went on a date with a matador, but it didn't work out.",
    "punchline": "There were just too many red flags."
  },
  {
    "id": 4,
    "setup": "Yesterday, I found out that I'm colorblind.",
    "punchline": "It really came out of the purple."
  },
  {
    "id": 5,
    "setup": "Singing in the shower is great until you get shampoo in your mouth.",
    "punchline": "Then it's a soap opera!"
  },
  {
    "id": 6,
    "setup": "You might think that a snail would move faster without a shell...",
    "punchline": "...but it actually becomes more sluggish!"
  },
  {
    "id": 7,
    "setup": "Every morning, I tell my family that I'm going jogging and then I don't go.",
    "punchline": "It's a running joke."
  },
  {
    "id": 8,
    "setup": "I got mugged by six dwarves this morning.",
    "punchline": "Not Happy."
  },
  {
    "id": 9,
    "setup": "What do you call a bunch of chess players bragging about their games in a hotel lobby?",
    "punchline": "Chess nuts boasting in an open foyer…."
  },
  {
    "id": 10,
    "setup": "Where do stormtroopers do their Christmas shopping?",
    "punchline": "At the store next to Target."
  },
  {
    "id": 11,
    "setup": "I asked the surgeon if I could administer my own anesthetic.",
    "punchline": "He said: “Sure, knock yourself out.”"
  },
  {
    "id": 12,
    "setup": "I changed all my passwords to “Kenny”.",
    "punchline": "Now I have all Kenny Loggins. I’m Alright, I just like living in the Danger Zone."
  },
  {
    "id": 13,
    "setup": "I swallowed a bunch of synonyms today.",
    "punchline": "I got thesaurus throat I’ve ever had."
  },
  {
    "id": 14,
    "setup": "I just super-glued my finger to my thumb.",
    "punchline": "I'll be OK for a while."
  },
  {
    "id": 15,
    "setup": "Why was Yoda afraid of 7?",
    "punchline": "Because 6 7 8."
  },
  {
    "id": 16,
    "setup": "A photographer was injured when a huge chunk of cheddar fell on him.",
    "punchline": "All the people in the picture were trying to warn him."
  }
]