[
  {
    "id": 1,
    "setup": "Why did the scarecrow win an award?",
    "punchline": "Because he was outstanding in his field."
  },
  {
    "id": 2,
    "setup": "I told my wife she was drawing her eyebrows too high.",
    "punchline": "She looked surprised."
  },
  {
    "id": 3,
    "setup": "I went on a date with a matador, but it didn't work out.",
    "punchline": "There were just too many red flags."
  },
  {
    "id": 4,
    "setup": "Yesterday, I found out that I'm colorblind.",
    "punchline": "It really came out of the purple."
  },
  {
    "id": 5,
    "setup": "Singing in the shower is great until you get shampoo in your mouth.",
    "punchline": "Then it's a soap opera!"
  },
  {
    "id": 6,
    "setup": "You might think that a snail would move faster without a shell...",
    "punchline": "...but it actually becomes more sluggish!"
  },
  {
    "id": 7,
    "setup": "Every morning, I tell my family that I'm going jogging and then I don't go.",
    "punchline": "It's a running joke."
  },
  {
    "id": 8,
    "setup": "I got mugged by six dwarves this morning.",
    "punchline": "Not Happy."
  },
  {
    "id": 9,
    "setup": "What do you call a bunch of chess players bragging about their games in a hotel lobby?",
    "punchline": "Chess nuts boasting in an open foyer…."
  },
  {
    "id": 10,
    "setup": "Where do stormtroopers do their Christmas shopping?",
    "punchline": "At the store next to Target."
  },
  {
    "id": 11,
    "setup": "I asked the surgeon if I could administer my own anesthetic.",
    "punchline": "He said: “Sure, knock yourself out.”"
  },
  {
    "id": 12,
    "setup": "I changed all my passwords to “Kenny”.",
    "punchline": "Now I have all Kenny Loggins. I’m Alright, I just like living in the Danger Zone."
  },
  {
    "id": 13,
    "setup": "I swallowed a bunch of synonyms today.",
    "punchline": "I got thesaurus throat I’ve ever had."
  },
  {
    "id": 14,
    "setup": "I just super-glued my finger to my thumb.",
    "punchline": "I'll be OK for a while."
  },
  {
    "id": 15,
    "setup": "Why was Yoda afraid of 7?",
    "punchline": "Because 6 7 8."
  },
  {
    "id": 16,
    "setup": "A photographer was injured when a huge chunk of cheddar fell on him.",
    "punchline": "All the people in the picture were trying to warn him."
  },
  {
    "id": 17,
    "setup": "It was a big mistake, challenging Death to a pillow fight.",
    "punchline": "I wasn't prepared for the reaper cushions."
  },
  {
    "id": 18,
    "setup": "I quit my job at the helium factory.",
    "punchline": "I refuse to be spoken to in that tone."
  },
  {
    "id": 19,
    "setup": "Scientists tried to cross cheetah and crab genes together.",
    "punchline": "I am worried because it can go sideways fast."
  },
  {
    "id": 20,
    "setup": "What do you call a wreath made out of $100 bills?",
    "punchline": "Aretha Franklins"
  },
  {
    "id": 21,
    "setup": "Who is the patron saint of copying people on emails?",
    "punchline": "Saint Francis of a CC."
  },
  {
    "id": 22,
    "setup": "What did the third wise man say after his friends had already presented gold and frankincense?",
    "punchline": "“But wait, there's myrrh!”"
  },
  {
    "id": 23,
    "setup": "A camper accidentally got his sleeve on fire from a camp fire. Fortunately, a park ranger was nearby and helped put the flames out. Then he wrote the camper a ticket. “What's this for?” the camper asked.",
    "punchline": "“Brandishing a firearm.”"
  },
  {
    "id": 24,
    "setup": "Did you know that the Kool-Aid man plays baseball?",
    "punchline": "He's a pitcher."
  },
  {
    "id": 25,
    "setup": "My great grandfather invented the cold air balloon.",
    "punchline": "It never really took off."
  },
  {
    "id": 26,
    "setup": "I kept wondering why music was coming from my printer.",
    "punchline": "Apparently the paper was jamming."
  },
  {
    "id": 27,
    "setup": "What do you call a cow with no legs?",
    "punchline": "Ground beef."
  },
  {
    "id": 28,
    "setup": "In the bank today a woman asked to check her balance,",
    "punchline": "So I pushed her over - zero balance."
  },
  {
    "id": 29,
    "setup": "I gave my handyman a to-do list, but he only did jobs 1, 3, and 5.",
    "punchline": "Turns out he only does odd jobs."
  },
  {
    "id": 30,
    "setup": "My wife asked me to pick up 6 cans of Sprite at the store.",
    "punchline": "I goofed and picked 7up."
  },
  {
    "id": 31,
    "setup": "One bird cannot make a pun.",
    "punchline": "But toucan."
  },
  {
    "id": 32,
    "setup": "Don't yell into a colander.",
    "punchline": "You'll strain your voice."
  },
  {
    "id": 33,
    "setup": "What do you call a medieval spy?",
    "punchline": "Sir Veillance"
  },
  {
    "id": 34,
    "setup": "Did you know Google was started by a knight?",
    "punchline": "Sir Chenjin"
  },
  {
    "id": 35,
    "setup": "Why do Peruvian owls hunt in pairs?",
    "punchline": "They are Inca hoots!"
  },
  {
    "id": 36,
    "setup": "The Cop said, \"I'm arresting you for downloading the entire Wikipedia.\"",
    "punchline": "I said, \"Wait! I can explain everything!\""
  },
  {
    "id": 37,
    "setup": "My wife is pretty mad at the fact that I have no sense of direction!",
    "punchline": "So I packed up and right!"
  },
  {
    "id": 38,
    "setup": "I saw there was a big sale at the lego store today.",
    "punchline": "People were lined up for blocks."
  },
  {
    "id": 39,
    "setup": "This morning, I was walking down the street and I was hit by a violin, then a clarinet, and then a french horn.",
    "punchline": "I think it was an orchestrated attack."
  },
  {
    "id": 40,
    "setup": "What do you call a line of men waiting to get haircuts?",
    "punchline": "A barberqueue. (And as it gets shorter, a receding hairline!)"
  },
  {
    "id": 41,
    "setup": "What did one tectonic plate say when they bumped into another?",
    "punchline": "Sorry! My fault..."
  },
  {
    "id": 42,
    "setup": "The stock market may be bad, but I slept like a baby last night.",
    "punchline": "I woke up every hour and cried."
  },
  {
    "id": 43,
    "setup": "Local police station was broken into and all the toilets were stolen.",
    "punchline": "The police have nothing to go on."
  },
  {
    "id": 44,
    "setup": "I wanted to buy my kid an Arnold Schwarzenegger figurine for his birthday. I asked the worker in the toy store where to find one. They said…",
    "punchline": "Aisle B back"
  },
  {
    "id": 45,
    "setup": "In an interview I was asked if I could perform Under Pressure.",
    "punchline": "I said I wasn't too sure, but I could do a wicked Bohemian Rhapsody."
  },
  {
    "id": 46,
    "setup": "New York is the opposite of Minnesota.",
    "punchline": "New York is where the Big Apple is and Minnesota is where Minneapolis."
  },
  {
    "id": 47,
    "setup": "What do you call a retired miner?",
    "punchline": "Doug."
  },
  {
    "id": 48,
    "setup": "I tried to rearrange the letters of “postman”.",
    "punchline": "He got real mad."
  },
  {
    "id": 49,
    "setup": "Bruce Lee had a brother that was never late.",
    "punchline": "His name was Earl."
  },
  {
    "id": 50,
    "setup": "What's the difference between Black-Eyed Peas and Chick Peas?",
    "punchline": "When asked, the Black Eyed Peas will sing us a song, however chickpeas will only hummus one."
  },
  {
    "id": 51,
    "setup": "I can't believe I got fired from a dairy farm.",
    "punchline": "They said I was a danger to myself and udders."
  },
  {
    "id": 52,
    "setup": "Multiple reports claiming Sting has been kidnapped.",
    "punchline": "The Police still have no lead."
  },
  {
    "id": 53,
    "setup": "Karl Marx had a sister - she was an Olympian runner.",
    "punchline": "Her name is Onya."
  },
  {
    "id": 54,
    "setup": "So I went on a date with a matador, but it didn't work out.",
    "punchline": "There were just too many red flags."
  },
  {
    "id": 55,
    "setup": "My dad raised me single-handedly.",
    "punchline": "It wasn't easy being the child of a pirate."
  },
  {
    "id": 56,
    "setup": "I just found out that Albert Einstein was a real person!",
    "punchline": "All this time I thought he was just a theoretical physicist."
  },
  {
    "id": 57,
    "setup": "A word of financial advice: don't invest your life savings in equestrian equipment.",
    "punchline": "You'll be saddled with debt."
  },
  {
    "id": 58,
    "setup": "I asked the librarian if the library had books on paranoia.",
    "punchline": "She whispered, “They're right behind you.”"
  },
  {
    "id": 59,
    "setup": "Dad worked for 14 hours to put food on the table.",
    "punchline": "Great man, slow cook."
  },
  {
    "id": 60,
    "setup": "What is another name for a cows knee?",
    "punchline": "A burger joint."
  },
  {
    "id": 61,
    "setup": "Not all construction work is equally enjoyable.",
    "punchline": "For example, enlarging a drilled hole is boring, but fastening pieces of metal together is riveting."
  },
  {
    "id": 62,
    "setup": "A Mobius strip walks into a bar.",
    "punchline": "Seeing it sobbing, the bartender asks what's wrong. The Mobius strip replies, \"Where do I even begin?\""
  },
  {
    "id": 63,
    "setup": "I tried using WD40 to get rid of the mice in my house.",
    "punchline": "It didn't work and now I can't even hear the squeaking anymore."
  },
  {
    "id": 64,
    "setup": "What do you call an emergency cheese sandwich?",
    "punchline": "A just in quesadilla."
  },
  {
    "id": 65,
    "setup": "There's a condition called pica, where people eat odd things. There's also a condition where people eat pokemon cards.",
    "punchline": "It's called pika chew."
  },
  {
    "id": 66,
    "setup": "Did you hear about the Invisible Man going to the hospital?",
    "punchline": "He was in reception all night waiting to be seen!"
  },
  {
    "id": 67,
    "setup": "I told my friend: There's only one thing that scares me during Halloween...",
    "punchline": "Friend: \"Which is?\" Me: \"Exactly\""
  },
  {
    "id": 68,
    "setup": "Working at the hydrant factory was terrible.",
    "punchline": "You couldn't park anywhere near the place."
  },
  {
    "id": 69,
    "setup": "Why don't you see elephants hiding in trees?",
    "punchline": "Because they're so good at it."
  },
  {
    "id": 70,
    "setup": "I saw a crime committed at the fruit market.",
    "punchline": "It was bananas."
  },
  {
    "id": 71,
    "setup": "If riding motorcycles gives you short term memory loss...",
    "punchline": "Just imagine what riding motorcycles will do!"
  },
  {
    "id": 72,
    "setup": "What do you call crows that stick together?",
    "punchline": "Velcrows"
  },
  {
    "id": 73,
    "setup": "Why did the sea monster eat three boats transporting potatoes?",
    "punchline": "Because nobody can stop after just one potato ship!"
  },
  {
    "id": 74,
    "setup": "What do you call an apology written in dots and dashes?",
    "punchline": "Re-Morse code."
  },
  {
    "id": 75,
    "setup": "How do you fix a broken pumpkin?",
    "punchline": "With a pumpkin patch!"
  },
  {
    "id": 76,
    "setup": "I laid in bed last night to read the dictionary, but I didn't finish it.",
    "punchline": "I got up to P."
  },
  {
    "id": 77,
    "setup": "What do you call a knight who hates fighting?",
    "punchline": "Sir Render!"
  },
  {
    "id": 78,
    "setup": "You tell the punchline first.",
    "punchline": "How do you mess up a joke?"
  },
  {
    "id": 79,
    "setup": "When does a joke become a dad joke?",
    "punchline": "When the punchline becomes apparent."
  },
  {
    "id": 80,
    "setup": "The police officer pulled over the driver with an electric car.",
    "punchline": "When the driver asked why, the police officer explained that the driver was without a current license."
  },
  {
    "id": 81,
    "setup": "The defense attorney told the prosecutor \"my client couldn't have done it as he was trapped in a penny\".",
    "punchline": "He is in a cent."
  }
]